In [1]:
import pandas as pd
import numpy as np

## 8.2 Create pivot_table in the DataFrame

In [2]:
pd.read_csv("sales_by_employee.csv").head()

     Date   Name       Customer  Revenue  Expenses
0  1/1/20  Oscar  Logistics XYZ     5250       531
1  1/1/20  Oscar    Money Corp.     4406       661
2  1/2/20  Oscar     PaperMaven     8661      1401
3  1/3/20  Oscar    PaperGenius     7075       906
4  1/4/20  Oscar    Paper Pound     2524      1767

In [3]:
sales = pd.read_csv("sales_by_employee.csv", parse_dates = ["Date"])

C:\Users\gjdbs\AppData\Local\Temp\ipykernel_32092\1447402296.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  sales = pd.read_csv("sales_by_employee.csv", parse_dates = ["Date"])

In [4]:
sales.head()

        Date   Name       Customer  Revenue  Expenses
0 2020-01-01  Oscar  Logistics XYZ     5250       531
1 2020-01-01  Oscar    Money Corp.     4406       661
2 2020-01-02  Oscar     PaperMaven     8661      1401
3 2020-01-03  Oscar    PaperGenius     7075       906
4 2020-01-04  Oscar    Paper Pound     2524      1767

In [5]:
sales.pivot_table(index = "Date", values = ["Revenue", "Expenses"], aggfunc= "sum")

            Expenses  Revenue
Date
2020-01-01      3825    25761
2020-01-02      6222    36515
2020-01-03      7882    29195
2020-01-04      7253    19740
2020-01-05      4785    19339

In [6]:
sales.pivot_table(
    index = "Date",
    columns = "Name",
    values = "Revenue",
    aggfunc = "sum"
)

Name          Creed   Dwight     Jim  Michael   Oscar
Date
2020-01-01   4430.0   2639.0  1864.0   7172.0  9656.0
2020-01-02  13214.0      NaN  8278.0   6362.0  8661.0
2020-01-03      NaN  11912.0  4226.0   5982.0  7075.0
2020-01-04   3144.0      NaN  6155.0   7917.0  2524.0
2020-01-05    938.0   7771.0     NaN   7837.0  2793.0

In [7]:
sales.pivot_table(
    index = "Date",
    columns = "Name",
    values = "Revenue",
    aggfunc = "sum",
    fill_value = 0
)

Name        Creed  Dwight   Jim  Michael  Oscar
Date
2020-01-01   4430    2639  1864     7172   9656
2020-01-02  13214       0  8278     6362   8661
2020-01-03      0   11912  4226     5982   7075
2020-01-04   3144       0  6155     7917   2524
2020-01-05    938    7771     0     7837   2793

In [8]:
sales.pivot_table(
    index = "Date",
    columns = "Name",
    values = "Revenue",
    aggfunc = "sum",
    fill_value = 0,
    margins = True
)

Name                 Creed  Dwight    Jim  Michael  Oscar     All
Date
2020-01-01 00:00:00   4430    2639   1864     7172   9656   25761
2020-01-02 00:00:00  13214       0   8278     6362   8661   36515
2020-01-03 00:00:00      0   11912   4226     5982   7075   29195
2020-01-04 00:00:00   3144       0   6155     7917   2524   19740
2020-01-05 00:00:00    938    7771      0     7837   2793   19339
All                  21726   22322  20523    35270  30709  130550

In [10]:
sales.pivot_table(
    index = "Date",
    columns = "Name",
    values = "Revenue",
    aggfunc = "sum",
    fill_value = 0,
    margins = True,
    margins_name = "Total"
)

Name                 Creed  Dwight    Jim  Michael  Oscar   Total
Date
2020-01-01 00:00:00   4430    2639   1864     7172   9656   25761
2020-01-02 00:00:00  13214       0   8278     6362   8661   36515
2020-01-03 00:00:00      0   11912   4226     5982   7075   29195
2020-01-04 00:00:00   3144       0   6155     7917   2524   19740
2020-01-05 00:00:00    938    7771      0     7837   2793   19339
Total                21726   22322  20523    35270  30709  130550

In [11]:
sales.pivot_table(
    index = "Date",
    columns = "Name",
    values = "Revenue",
    aggfunc = "count"
)

Name        Creed  Dwight  Jim  Michael  Oscar
Date
2020-01-01    1.0     1.0  1.0      1.0    2.0
2020-01-02    2.0     NaN  1.0      1.0    1.0
2020-01-03    NaN     3.0  1.0      1.0    1.0
2020-01-04    1.0     NaN  2.0      1.0    1.0
2020-01-05    1.0     1.0  NaN      1.0    1.0

In [13]:
sales.pivot_table(
    index = "Date",
    columns = "Name",
    values = "Revenue",
    aggfunc = ["sum", "count"]
)

                sum                                  count              \
Name          Creed   Dwight     Jim Michael   Oscar Creed Dwight  Jim
Date
2020-01-01   4430.0   2639.0  1864.0  7172.0  9656.0   1.0    1.0  1.0
2020-01-02  13214.0      NaN  8278.0  6362.0  8661.0   2.0    NaN  1.0
2020-01-03      NaN  11912.0  4226.0  5982.0  7075.0   NaN    3.0  1.0
2020-01-04   3144.0      NaN  6155.0  7917.0  2524.0   1.0    NaN  2.0
2020-01-05    938.0   7771.0     NaN  7837.0  2793.0   1.0    1.0  NaN


Name       Michael Oscar
Date
2020-01-01     1.0   2.0
2020-01-02     1.0   1.0
2020-01-03     1.0   1.0
2020-01-04     1.0   1.0
2020-01-05     1.0   1.0

In [15]:
sales.pivot_table(
    index = "Date",
    columns = "Name",
    values = ["Revenue", "Expenses"],
    aggfunc = {"Revenue" : "min", "Expenses" : "min"}
)

           Expenses                                 Revenue                  \
Name          Creed  Dwight     Jim Michael   Oscar   Creed  Dwight     Jim
Date
2020-01-01    548.0   368.0  1305.0   412.0   531.0  4430.0  2639.0  1864.0
2020-01-02   1768.0     NaN   462.0   685.0  1401.0  5188.0     NaN  8278.0
2020-01-03      NaN   758.0  1923.0  1772.0   906.0     NaN  2703.0  4226.0
2020-01-04   1314.0     NaN   426.0  1857.0  1767.0  3144.0     NaN  2287.0
2020-01-05   1053.0  1475.0     NaN  1633.0   624.0   938.0  7771.0     NaN


Name       Michael   Oscar
Date
2020-01-01  7172.0  4406.0
2020-01-02  6362.0  8661.0
2020-01-03  5982.0  7075.0
2020-01-04  7917.0  2524.0
2020-01-05  7837.0  2793.0

In [21]:
sales.pivot_table(
    index = ["Name", "Date"],
    values = "Revenue",
    aggfunc = "sum"
).head()

                   Revenue
Name   Date
Creed  2020-01-01     4430
       2020-01-02    13214
       2020-01-04     3144
       2020-01-05      938
Dwight 2020-01-01     2639

In [23]:
sales.pivot_table(
    index = ["Date", "Name"],
    values = "Revenue",
    aggfunc = "sum"
).head(10)

                    Revenue
Date       Name
2020-01-01 Creed       4430
           Dwight      2639
           Jim         1864
           Michael     7172
           Oscar       9656
2020-01-02 Creed      13214
           Jim         8278
           Michael     6362
           Oscar       8661
2020-01-03 Dwight     11912

## 8.3 Index level stack and unstack

In [24]:
sales.head()

        Date   Name       Customer  Revenue  Expenses
0 2020-01-01  Oscar  Logistics XYZ     5250       531
1 2020-01-01  Oscar    Money Corp.     4406       661
2 2020-01-02  Oscar     PaperMaven     8661      1401
3 2020-01-03  Oscar    PaperGenius     7075       906
4 2020-01-04  Oscar    Paper Pound     2524      1767

In [26]:
by_name_and_date = sales.pivot_table(
    index = "Name",
    columns = "Date",
    values = "Revenue",
    aggfunc = "sum"
)

In [27]:
by_name_and_date

Date     2020-01-01  2020-01-02  2020-01-03  2020-01-04  2020-01-05
Name
Creed        4430.0     13214.0         NaN      3144.0       938.0
Dwight       2639.0         NaN     11912.0         NaN      7771.0
Jim          1864.0      8278.0      4226.0      6155.0         NaN
Michael      7172.0      6362.0      5982.0      7917.0      7837.0
Oscar        9656.0      8661.0      7075.0      2524.0      2793.0

In [28]:
by_name_and_date.stack()

Name     Date
Creed    2020-01-01     4430.0
         2020-01-02    13214.0
         2020-01-04     3144.0
         2020-01-05      938.0
Dwight   2020-01-01     2639.0
         2020-01-03    11912.0
         2020-01-05     7771.0
Jim      2020-01-01     1864.0
         2020-01-02     8278.0
         2020-01-03     4226.0
         2020-01-04     6155.0
Michael  2020-01-01     7172.0
         2020-01-02     6362.0
         2020-01-03     5982.0
         2020-01-04     7917.0
         2020-01-05     7837.0
Oscar    2020-01-01     9656.0
         2020-01-02     8661.0
         2020-01-03     7075.0
         2020-01-04     2524.0
         2020-01-05     2793.0
dtype: float64

In [30]:
sales_by_customer = sales.pivot_table(
    index = ["Customer", "Name"],
    values = "Revenue",
    aggfunc = "sum"
)
sales_by_customer.head()

                           Revenue
Customer          Name
Average Paper Co. Creed      13214
                  Jim         2287
Best Paper Co.    Dwight      2703
                  Michael    15754
Logistics XYZ     Dwight      9209

In [31]:
sales_by_customer.unstack()

                   Revenue
Name                 Creed  Dwight     Jim  Michael   Oscar
Customer
Average Paper Co.  13214.0     NaN  2287.0      NaN     NaN
Best Paper Co.         NaN  2703.0     NaN  15754.0     NaN
Logistics XYZ          NaN  9209.0     NaN   7172.0  5250.0
Money Corp.         5368.0     NaN  8278.0      NaN  4406.0
Paper Pound            NaN  7771.0  4226.0      NaN  5317.0
PaperGenius            NaN  2639.0  1864.0  12344.0  7075.0
PaperMaven          3144.0     NaN  3868.0      NaN  8661.0

## 8.4 Unpivot the Dataset

In [34]:
sales.head(1)

  Date       Name   Customer        Revenue  Expenses
0 2020-01-01  Oscar  Logistics XYZ  5250     531

In [35]:
video_game_sales = pd.read_csv("video_game_sales.csv")

In [36]:
video_game_sales

,Name,NA,EU,JP,Other
0,Wii Sports,41.49,29.02,3.77,8.46
1,Super Mario Bros.,29.08,3.58,6.81,0.77
2,Mario Kart Wii,15.85,12.88,3.79,3.31
3,Wii Sports Resort,15.75,11.01,3.28,2.96
4,Pokemon Red/Pokemon Blue,11.27,8.89,10.22,1.00
...,...,...,...,...,...
16561,Woody Woodpecker in Crazy Castle 5,0.01,0.00,0.00,0.00
16562,Men in Black II: Alien Escape,0.01,0.00,0.00,0.00
16563,SCORE International Baja 1000: The Official Game,0.00,0.00,0.00,0.00
16564,Know How 2,0.00,0.01,0.00,0.00
16565,Spirits & Spells,0.01,0.00,0.00,0.00

In [38]:
video_game_sales.melt(id_vars = "Name", value_vars = "NA").head()

  Name                      variable  value
0                Wii Sports  NA       41.49
1         Super Mario Bros.  NA       29.08
2            Mario Kart Wii  NA       15.85
3         Wii Sports Resort  NA       15.75
4  Pokemon Red/Pokemon Blue  NA       11.27

In [41]:
video_game_sales.melt(id_vars = "Name", value_vars = ["NA", "EU", "JP", "Other"])

      Name                                              variable  value
0                                            Wii Sports     NA    41.49
1                                     Super Mario Bros.     NA    29.08
2                                        Mario Kart Wii     NA    15.85
3                                     Wii Sports Resort     NA    15.75
4                              Pokemon Red/Pokemon Blue     NA    11.27
...                                                 ...      ...    ...
66259                Woody Woodpecker in Crazy Castle 5  Other     0.00
66260                     Men in Black II: Alien Escape  Other     0.00
66261  SCORE International Baja 1000: The Official Game  Other     0.00
66262                                        Know How 2  Other     0.00
66263                                  Spirits & Spells  Other     0.00

[66264 rows x 3 columns]

In [43]:
video_game_sales_by_region = video_game_sales.melt(id_vars = "Name", value_vars = ["NA", "EU", "JP", "Other"], var_name = "Region", value_name = "Sales")

In [44]:
video_game_sales_by_region

      Name                                              Region  Sales
0                                            Wii Sports     NA  41.49
1                                     Super Mario Bros.     NA  29.08
2                                        Mario Kart Wii     NA  15.85
3                                     Wii Sports Resort     NA  15.75
4                              Pokemon Red/Pokemon Blue     NA  11.27
...                                                 ...    ...    ...
66259                Woody Woodpecker in Crazy Castle 5  Other   0.00
66260                     Men in Black II: Alien Escape  Other   0.00
66261  SCORE International Baja 1000: The Official Game  Other   0.00
66262                                        Know How 2  Other   0.00
66263                                  Spirits & Spells  Other   0.00

[66264 rows x 3 columns]

In [49]:
video_game_sales_by_region.pivot_table(
    index = "Name",
    values = "Sales",
    aggfunc = "sum"
).sort_values("Sales", ascending = False)

                           Sales
Name
Wii Sports                 82.74
Grand Theft Auto V         55.92
Super Mario Bros.          45.31
Tetris                     35.84
Mario Kart Wii             35.83
...                          ...
Rail Simulator              0.01
Elven Legacy Collection     0.01
Elven Legacy                0.01
Spore Galactic Adventures   0.01
Kurogane Kaikitan           0.01

[11462 rows x 1 columns]

## 8.5 Expand the list of values

In [50]:
recipes = pd.read_csv("recipes.csv")

In [51]:
recipes

  Recipe                   Ingredients
0   Cashew Crusted Chicken  Apricot preserves, Dijon mustard, curry powder...
1      Tomato Basil Salmon  Salmon filets, basil, tomato, olive oil, Parme...
2  Parmesan Cheese Chicken  Bread crumbs, Parmesan cheese, Italian seasoni...

In [53]:
recipes["Ingredients"].str.split(",")

0    [Apricot preserves,  Dijon mustard,  curry pow...
1    [Salmon filets,  basil,  tomato,  olive oil,  ...
2    [Bread crumbs,  Parmesan cheese,  Italian seas...
Name: Ingredients, dtype: object

In [54]:
recipes["Ingredients"] = recipes["Ingredients"].str.split(",")

In [55]:
recipes

  Recipe                   Ingredients
0   Cashew Crusted Chicken  [Apricot preserves,  Dijon mustard,  curry pow...
1      Tomato Basil Salmon  [Salmon filets,  basil,  tomato,  olive oil,  ...
2  Parmesan Cheese Chicken  [Bread crumbs,  Parmesan cheese,  Italian seas...

In [56]:
recipes.explode("Ingredients")

  Recipe                   Ingredients
0   Cashew Crusted Chicken   Apricot preserves
0   Cashew Crusted Chicken       Dijon mustard
0   Cashew Crusted Chicken        curry powder
0   Cashew Crusted Chicken     chicken breasts
0   Cashew Crusted Chicken             cashews
1      Tomato Basil Salmon       Salmon filets
1      Tomato Basil Salmon               basil
1      Tomato Basil Salmon              tomato
1      Tomato Basil Salmon           olive oil
1      Tomato Basil Salmon     Parmesan cheese
2  Parmesan Cheese Chicken        Bread crumbs
2  Parmesan Cheese Chicken     Parmesan cheese
2  Parmesan Cheese Chicken   Italian seasoning
2  Parmesan Cheese Chicken                 egg
2  Parmesan Cheese Chicken     chicken breasts

## 8.6 Coding Challenge

In [58]:
cars = pd.read_csv("used_cars.csv")
cars

       Manufacturer  Year Fuel   Transmission  Price
0           Acura    2012    Gas  Automatic    10299
1          Jaguar    2011    Gas  Automatic     9500
2           Honda    2004    Gas  Automatic     3995
3       Chevrolet    2016    Gas  Automatic    41988
4             Kia    2015    Gas  Automatic    12995
...             ...   ...    ...          ...    ...
460461      Rover    2008    Gas  Automatic     7950
460462     Nissan    2016    Gas  Automatic    13995
460463        BMW    2010    Gas  Automatic    10995
460464      Dodge    2015  Other     Manual     6495
460465        GMC    2008    Gas  Automatic     8990

[460466 rows x 5 columns]

In [59]:
min_wage = pd.read_csv("minimum_wage.csv")
min_wage.head()

  State        2010  2011  2012  2013  2014  2015  2016   2017
0     Alabama  0.00  0.00  0.00  0.00  0.00  0.00   0.00   0.00
1      Alaska  8.90  8.63  8.45  8.33  8.20  9.24  10.17  10.01
2     Arizona  8.33  8.18  8.34  8.38  8.36  8.50   8.40  10.22
3    Arkansas  7.18  6.96  6.82  6.72  6.61  7.92   8.35   8.68
4  California  9.19  8.91  8.72  8.60  9.52  9.51  10.43  10.22

In [62]:
cars.pivot_table(
    index = "Fuel",
    values = "Price",
    aggfunc = "sum"
)

          Price
Fuel
Diesel      986177143
Electric     18502957
Gas       86203853926
Hybrid       44926064
Other       242096286

In [66]:
cars.pivot_table(
    index = "Manufacturer",
    columns = "Transmission",
    values = "Price",
    aggfunc = "count",
    margins = True
)

Transmission     Automatic  Manual   Other    All
Manufacturer
Acura              3443.0     141.0     48.0    3632
Alfa-Romeo           50.0       NaN     11.0      61
Aston-Martin         20.0       5.0      NaN      25
Audi               4974.0     375.0     69.0    5418
BMW               11641.0     774.0    627.0   13042
Buick              6187.0      17.0    265.0    6469
Cadillac           6357.0      74.0    406.0    6837
Chevrolet         61006.0    1820.0   4255.0   67081
Chrysler           7553.0     133.0    212.0    7898
Dodge             14338.0     626.0    991.0   15955
Ferrari              29.0       4.0      9.0      42
Fiat                435.0     220.0    187.0     842
Ford              75980.0    2979.0   3505.0   82464
GMC               19504.0     137.0    939.0   20580
Harley-Davidson     115.0      61.0     10.0     186
Hennessey             NaN       1.0      NaN       1
Honda             20666.0    1502.0    921.0   23089
Hyundai           10350.0     544.0    334.0   11228
Infiniti           3555.0     185.0     76.0    3816
Jaguar              882.0      29.0     50.0     961
Jeep              17687.0    2316.0   1385.0   21388
Kia                7615.0     466.0    587.0    8668
Land Rover           23.0       NaN      NaN      23
Lexus              5573.0      30.0    226.0    5829
Lincoln            3001.0      10.0     51.0    3062
Mazda              4127.0     746.0    649.0    5522
Mercedes-Benz      9599.0      74.0     98.0    9771
Mercury            1437.0      15.0      2.0    1454
Mini               1411.0     712.0    138.0    2261
Mitsubishi         2064.0     247.0     52.0    2363
Nissan            22262.0     858.0   1429.0   24549
Pontiac            2710.0     213.0     28.0    2951
Porche                9.0       1.0      NaN      10
Ram               19996.0     837.0   1243.0   22076
Rover              1752.0       9.0     24.0    1785
Saturn             1451.0     152.0     12.0    1615
Subaru             8317.0    1884.0    420.0   10621
Tesla               179.0       NaN     59.0     238
Toyota            31480.0    1367.0   2134.0   34981
Volkswagen         7985.0    1286.0    236.0    9507
Volvo              2665.0     155.0     50.0    2870
All              398428.0   21005.0  21738.0  441171

In [68]:
cars.pivot_table(
    index = ['Year', "Fuel"],
    columns = "Transmission",
    values = "Price",
    aggfunc = "mean"
)

Transmission   Automatic     Manual        Other
Year Fuel
2000 Diesel    11326.176962  14010.164021  11075.000000
     Electric   1500.000000           NaN           NaN
     Gas        4314.675996   6226.140327   3203.538462
     Hybrid     2600.000000   2400.000000           NaN
     Other     16014.918919  11361.952381  12984.642857
...                     ...           ...           ...
2020 Diesel    63272.595930      1.000000   1234.000000
     Electric   8015.166667   2200.000000  20247.500000
     Gas       34925.857933  36007.270833  20971.045455
     Hybrid    35753.200000           NaN   1234.000000
     Other     22210.306452           NaN   2725.925926

[102 rows x 3 columns]

In [69]:
cars_pivot = cars.pivot_table(
    index = ['Year', "Fuel"],
    columns = "Transmission",
    values = "Price",
    aggfunc = "mean"
)

In [70]:
cars_pivot.stack()

Year  Fuel      Transmission
2000  Diesel    Automatic       11326.176962
                Manual          14010.164021
                Other           11075.000000
      Electric  Automatic        1500.000000
      Gas       Automatic        4314.675996
                                    ...
2020  Gas       Other           20971.045455
      Hybrid    Automatic       35753.200000
                Other            1234.000000
      Other     Automatic       22210.306452
                Other            2725.925926
Length: 274, dtype: float64

In [72]:
min_wage.head()

  State        2010  2011  2012  2013  2014  2015  2016   2017
0     Alabama  0.00  0.00  0.00  0.00  0.00  0.00   0.00   0.00
1      Alaska  8.90  8.63  8.45  8.33  8.20  9.24  10.17  10.01
2     Arizona  8.33  8.18  8.34  8.38  8.36  8.50   8.40  10.22
3    Arkansas  7.18  6.96  6.82  6.72  6.61  7.92   8.35   8.68
4  California  9.19  8.91  8.72  8.60  9.52  9.51  10.43  10.22

In [81]:
min_wage.melt(
    id_vars = "State", 
    value_vars = ["2010", "2011", "2012", "2013", "2014", "2015", "2016", "2017"]
)

    State          variable  value
0          Alabama  2010      0.00
1           Alaska  2010      8.90
2          Arizona  2010      8.33
3         Arkansas  2010      7.18
4       California  2010      9.19
..             ...      ...    ...
435       Virginia  2017      7.41
436     Washington  2017     11.24
437  West Virginia  2017      8.94
438      Wisconsin  2017      7.41
439        Wyoming  2017      5.26

[440 rows x 3 columns]

In [82]:
min_wage.melt(
    id_vars = "State", 
)

    State          variable  value
0          Alabama  2010      0.00
1           Alaska  2010      8.90
2          Arizona  2010      8.33
3         Arkansas  2010      7.18
4       California  2010      9.19
..             ...      ...    ...
435       Virginia  2017      7.41
436     Washington  2017     11.24
437  West Virginia  2017      8.94
438      Wisconsin  2017      7.41
439        Wyoming  2017      5.26

[440 rows x 3 columns]